'''
14. Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.

Грінченко Маргарита 122
'''
import numpy as np
while True:

    A = np.zeros(10, dtype = int)
    i, sec = 0, 1
    for i in range(10):
        A[i] = sec
        sec += 1

    for i in range(10):
        print(f'{A[i]} секунд = {(9.8*A[i]*A[i])/2}')
            
    if input('Введіть пустий рядок, щоб перезапустити') == '':
        continue
    break
